docs/chapter1.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2020-11-22 Sun 13:41 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Sibi Prabakaran">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://psibi.in/prometheus/"> UP </a>
 |
 <a accesskey="H" href="https://psibi.in/"> HOME </a>
</div><div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Monitoring Mechanics</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Probing and Instrospection</a></li>
<li><a href="#sec-2-2">2.2. Pull versus push</a></li>
<li><a href="#sec-2-3">2.3. Types of Monitoring data</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Metrics</a></li>
<li><a href="#sec-4">4. Types of metrics</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. Gauges</a></li>
<li><a href="#sec-4-2">4.2. Counters</a></li>
<li><a href="#sec-4-3">4.3. Histogram</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Metric Summaries</a></li>
<li><a href="#sec-6">6. Metric aggregation</a></li>
<li><a href="#sec-7">7. Monitoring methodologies</a>
<ul class="nav">
<li><a href="#sec-7-1">7.1. The USE method</a></li>
<li><a href="#sec-7-2">7.2. The Google Four Golden Signals</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Contextual, useful alerts and notifications</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Monitoring is the tools and processes by which you measure and manage
your technology systems.
</p>

<p>
Monitoring has two customers:
</p>
<ul class="org-ul">
<li>Technology: That's you, your team that maintain your technology
environment.
</li>
<li>Business
</li>
</ul>

<p>
Monitoring anti-patterns:
</p>
<ul class="org-ul">
<li>Monitoring as afterthought.
</li>
<li>Monitoring by rote
</li>
<li>Non monitoring for correctness.
</li>
<li>Monitoring statically.
</li>
<li>Not monitoring frequently enough.
</li>
<li>No automation or self-service.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Monitoring Mechanics</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Probing and Instrospection</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Probing monitoring probesa the outside of an application. Example:
Performing ICMP check and confirming you have recieved a
response. Nagios is based on probe monitoring.
</p>

<p>
Introspection monitoring looks at what's inside the application. The
application is instrumented and returns measumenet of its state.
</p>

<p>
Introspection monitoring communicates with more richer state of your
application than probe monitoring. But probe monitoring might be the
only monitoring you would be able to do for a third party website.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Pull versus push</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Pull based systems scrape or check a remote application.
</p>

<p>
In push based systems, application emit events that are received by
the monitoring system.
</p>

<p>
Prometheus is primarily a pull based system, but it also supports
receiving events pushed into a gateway.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Types of Monitoring data</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Metrics
</li>
<li>Logs: are (usually textual) events emitted from an application.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Metrics</h2>
<div class="outline-text-2" id="text-3">
<p>
Metrics are measures of properties of components software or hardware.
</p>

<p>
To make a metric useful we keep track of its state, generally
recording data points over time. Those data points are called
ovservations.
</p>

<p>
A collection of observation is called time series.
</p>

<p>
We generally collect observations at a fixed time interval - we call
this the <b>granularity</b> or <b>resolution</b>.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Types of metrics</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Gauges</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Gauges are numbers that are expected to go up or down. Example: CPU
usage.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Counters</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Counters are numbers that increase over time and never
decrease. Example: System uptime.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Histogram</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Histogram is a metric that samples observations. <a href="https://www.mathsisfun.com/data/histograms.html">Reference</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Metric Summaries</h2>
<div class="outline-text-2" id="text-5">
<p>
Often single metric isn't useful and visualization of a metric
requires applying mathematical transformations to it. Some common
functions are:
</p>

<ul class="org-ul">
<li>Counter or n - Counts the number of observations in a specific time
interval.
</li>
<li>Sum
</li>
<li>Average
</li>
<li><a href="https://www.mathsisfun.com/median.html">Median</a>
</li>
<li><a href="https://www.mathsisfun.com/data/percentiles.html">Percentile</a>
</li>
<li><a href="https://www.mathsisfun.com/data/standard-deviation.html">Standard deviation</a>
</li>
<li>Rate of Change
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Metric aggregation</h2>
<div class="outline-text-2" id="text-6">
<p>
Useful for showing aggregated views of metrics from multiple sources
aux as disk space usage of all your application servers.
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Monitoring methodologies</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Brendan Gregg's USE or Utilization Saturation and Errors method
which focuses on host level monitoring.
</li>
<li>Google's Four Golden Signals which focuses on application level
monitoring.
</li>
</ul>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> The USE method</h3>
<div class="outline-text-3" id="text-7-1">
<p>
The methodology proposes creating a checklist for server analysis that
allows the fast identification of issues.
</p>

<p>
The USE method can be summarized as: <b>For every resource, check
utlilization, staturation, and errors</b>.
</p>

<p>
Terminology:
</p>

<ul class="org-ul">
<li>A resource - A component of a system. In Gregg's definition of the
model it's traditionally a physical server component like CPUs.
</li>
<li>Utilization: The average time the resource is busy doing work. It's
usually expressed as a percentage over time.
</li>
<li>Saturation: The measure of queued work for a resource, work it can't
process yet. This is usually expressed as queue length.
</li>
<li>Errors: The scalar count of error events for a resources.
</li>
</ul>

<p>
So we create a checklist of the resources and an approach to monitor
each element of the methodlogy: utilization, saturation, and eerros.
</p>

<p>
So, let's say we have a perf issue. We will consult the checklist and
choose it's first resource. Assuming it's a CPU, we will go through
this:
</p>

<ul class="org-ul">
<li>CPU utilization as a percentage over time.
</li>
<li>CPU saturation as the number of processes waiting CPU time.
</li>
<li>Errors, generally less important for the CPU resource.
</li>
</ul>

<p>
Once we are done, we will then consult the checklist again and chose
the next resource (Eg: Memory). We go on through the checklist until
we've identified the bottleneck.
</p>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> The Google Four Golden Signals</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Compared to the USE method, the metric types in this methodlogy are
more application or user facing.
</p>

<ul class="org-ul">
<li>Latency: The time taken to service a request, distinguishing between
the latency of successful and failed requests.
</li>
<li>Traffic: The demand on your system. Eg: HTTP requests per second.
</li>
<li>Errors: The rate the requests fail. Explicit failure like HTTP 500
or Implicit like invalid content being returned etc.
</li>
<li>Saturation: The "fullness" of your application or the resources that
are constraining it - for example, memory or IO.
</li>
</ul>

<p>
Using golden signals is easy. Select high level metrics that match
each signal and build alerts for them.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Contextual, useful alerts and notifications</h2>
<div class="outline-text-2" id="text-8">
<p>
An alert is raised when something happens.
</p>

<p>
Notification takes the alert and tells someone or something about
it. Notification needs to be concise, articulate, accurate, digestible
and actionable.
</p>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Sibi Prabakaran</p>
<p class="date">Created: 2020-11-22 Sun 13:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.4)</p>
</div>
</footer>
</body>
</html>
